app/Controllers/Category.php

SELECT *
FROM `category`
WHERE `name` = 'bermudas'
 LIMIT 1
---
    protected function getCategoryByName($name)
    {
        return $this->categoryModel->where("name", get_original_url($name))->first();

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `product`.`name`, `product`.`price`, `product_image`.`url` AS `image`, `category`.`name` AS `category`
FROM `product`
JOIN `category` ON `category`.`category_id` = `product`.`category_id`
JOIN `product_image` ON `product_image`.`product_id` = `product`.`product_id`
JOIN `product_stock` ON `product_stock`.`product_id` = `product`.`product_id`
WHERE `product`.`category_id` = '5'
AND `product_stock`.`quantity` > 0
GROUP BY `product`.`product_id`
) CI_count_all_results
SELECT `product`.`name`, `product`.`price`, `product_image`.`url` AS `image`, `category`.`name` AS `category`
FROM `product`
JOIN `category` ON `category`.`category_id` = `product`.`category_id`
JOIN `product_image` ON `product_image`.`product_id` = `product`.`product_id`
JOIN `product_stock` ON `product_stock`.`product_id` = `product`.`product_id`
WHERE `product`.`category_id` = '5'
AND `product_stock`.`quantity` > 0
GROUP BY `product`.`product_id`
ORDER BY `product`.`name`
 LIMIT 20
---
    protected function getProductsByCategory($category)
    {
        return $this->productModel
            ->select('product.name, product.price, product_image.url AS image, category.name AS category')
            ->join('category', 'category.category_id = product.category_id')
            ->join('product_image', 'product_image.product_id = product.product_id')
            ->join('product_stock', 'product_stock.product_id = product.product_id')
            ->where('product.category_id', $category->category_id)
            ->where('product_stock.quantity >', 0)
            ->groupBy('product.product_id')
            ->orderBy('product.name')
            ->paginate(20);

SELECT *
FROM `config`
 LIMIT 1
---
    protected function getHeaderData($title = '')
    {
        return [
            "title" => ($title ? "{$title} - " : '') . PAGE_TITLE,
            "config" => (new ConfigModel)->asObject()->first() ?? null,

SELECT `name`
FROM `category`
ORDER BY `name`
---
    protected function getCategoriesData()
    {
        return [
            "categories" => $this->categoryModel->select("name")->orderBy("name")->asObject()->findAll()
        ];