app/Controllers/Home.php

    protected function getConfig()
    {
        return $this->configModel->asObject()->first() ?? null;
---
SELECT *
FROM `config`
 LIMIT 1