app/Controllers/Product.php

SELECT `product`.`product_id`, `product`.`name`, `product`.`price`, `category`.`name` AS `category`, `product_image`.`url` AS `image`
FROM `product`
JOIN `product_image` ON `product_image`.`product_id` = `product`.`product_id`
JOIN `category` ON `category`.`category_id` = `product`.`category_id`
JOIN `product_stock` ON `product_stock`.`product_id` = `product`.`product_id`
WHERE `product`.`name` LIKE '%cami%' ESCAPE '!'
AND `product_stock`.`quantity` > 0
GROUP BY `product`.`product_id`
---
    public function search($name)
    {
        $products = $this->productModel
            ->select("product.product_id, product.name, product.price, category.name AS category, product_image.url AS image")
            ->like("product.name", $name)
            ->join("product_image", "product_image.product_id = product.product_id")
            ->join("category", "category.category_id = product.category_id")
            ->join('product_stock', 'product_stock.product_id = product.product_id')
            ->where('product_stock.quantity >', 0)
            ->groupBy("product.product_id")
            ->findAll();